@extends('layouts.public', ['title' => 'درباره سامانه رخشای'])
@section('head')
<script type="application/ld+json">
  {
    "@context": "https://schema.org",
    "@type": "BreadcrumbList",
    "itemListElement": [{
      "@type": "ListItem",
      "position": 1,
      "name": "درباره ما",
      "item": "{{url()->full()}}"
    }]
  }
  </script>
@endsection
@section('content')
@include('layouts.header')
<div class="page-container about-us-page">
  <div class="container">
    <div class="row pt-5">
      <div class="col-12">
        <h1 class="text-center page-title">درباره رخشای</h1>
      </div>
    </div>
    <div class="row mt-5">
      <div class="col-md-4 col-sm-12 mb-3 order-1 order-md-0">
        <img src="{{asset('assets/images/main/rakhshai.jpg')}}" class="img-fluid rounded" alt="رخشای چیست؟">
      </div>
      <div class="col-md-8 col-sm-12 text-white pb-5 order-0 order-md-1">
        <div class="about-us-first">
          <p>
            من “رخشای” مخفف رخش ای آی اولین مدل هوش مصنوعی ایرانی هستم که با استفاده از توسعه اختصاصی موتور پردازش متنی زبان طبیعی با نام زال برای جمع آوری دیتاهای متنی و تحلیل آن در اول فروردین ماه خورشیدی شروع به کار کرده ام.
          </p>
          <p>
            ما برای جمع آوری دیتا از منابع بین المللی و کتابخانه های منبع باز استفاده کرده ایم تا بتوانیم یک دیتابیس بزرگ متنی برای موتور پردازشی هوش مصنوعی زال داشته باشیم.
          </p>
          <p>ما اعتقاد داریم بهترین روش برای رشد جامعه هوش مصنوعی در سطح بین الملل دسترسی به اطلاعات و منابع معتبر سراسر اینترنت است تا تمام هموطنان عزیزمان در سراسر نقاط کشور به بروزترین و کامل ترین منابع علمی با قدرت و توانایی هوش مصنوعی دسترسی داشته باشند.</p>
          <p>
            وظیفه من یک دستیار هوشمند بودن برای تمام کسب و کار های ایرانی است که دوست دارند محیط کسب و کار خود را با معیار های اولیه هوش مصنوعی افزایش دهند .
          </p>
          <p>
            شما می توانید از رخشای برای توسعه کسب و کار و رشد دانش شخصی خود در زمینه های کاری با موضوع برنامه نویسی ، مارکتینگ ، فلسفه ، ادبیات و تاریخ ، هنر ، تولید محتوا در وب و شبکه های اجتمایی و دامنه بسیاری از رشته های فنی استفاده کنید .
          </p>
          {{-- <p>
            ما در حال تست نسخه اولیه Auto-GPT هستیم و با استفاده از GPT3.5  در حال آموزش دیدن رخشای و نسخه آزمایش عمومی هستیم .
          </p> --}}
          <p>
            نسخه اولیه من با نام "زال" توسط گروه توسعه نرم افزاری شرکت آریاهامان مهرپارسه با شماره ثبت 3877 رونمایی "آزمایشی" شد و دیباگ های اولیه را پشت سر گذاشت.
          </p>
          <p>
            نسخه اولیه من بر مبنای پردازش متن است ...
          </p>
          <p>
            نسخه اولیه من توسعه داده شده تا بهترین پردازش را بر روی متن های ورودی کاربران ایرانی انجام دهم . هدف من ارائه یک پاسخ دقیق و مفید به سؤالات کاربران و همچنین ارائه راه حلهایی هوشمندانه و بهینه برای مسائل مختلف است. برای این کار، من به طور مداوم با داده های جدید آموزش داده میشوم تا بتوانم به صورت بهینه تر و دقیق تر در حل مسائل عمل کنم. متد های توسعه من بر مبنای همگام سازی فرهنگی و ملی ایرانی است.
          </p>
          <p>
            همچنین، من به عنوان یک مدل هوشمند، قابلیت یادگیری و بهبود پذیری را دارا هستم و با تکنیکهای بهینه سازی، قادر به ارائه بهترین پاسخها هستم و با دیتا های دریافتی توسعه پیدا می کنم. من تقریبا با اکثر زبان های انسانی قابلیت گفتگو با شما را دارم.
          </p>
        </div>

      </div>
    </div>
  </div>

  <div class="img-bg" style="background-image: url('{{asset('assets/images/main/about-us2.webp')}}')">
    <div class="container">
      <div class="row mt-5">
        <div class="col-lg-8 col-12 text-white pb-5">
          <div>
            <div class="mt-4 p-5 about-us-bottom text-white rounded">
              <p>ما در شرکت آریاهامان مهرپارسه تحقیقات اولیه خود را در سال 1399 با <a href="https://kafka.apache.org/">Apache Kafka</a> برای جمع آوری و تحلیل اولیه دیتا آغاز کردیم.</p>
              <p>مهمترین دغدغه ما در بحث آموزشی(Data Learning) برای مدل های شبکه های عصبی یادگیری خودمان، جمع آوری دیتا بوده و هست که ابتدای امر از سورس های منبع باز متنی مرجع و دیتاهای متنی در دسترس شرکت  <a href="https://openai.com/">OpenAI</a> استفاده می کنیم.</p>
              <p>هدف اصلی این تلاش، تحلیل داده‌ها و ارائه پاسخ به سوالات کاربران است.</p>
              <p>برای تحلیل دیتاهای ورودی و ذخیره شده از تعدادی کتابخانه معروف در زبان برنامه‌نویسی پایتون و سرویس های معتبر برای Data Learning استفاده می‌شود. این کتابخانه‌ها و سرویس ها شامل موارد زیر می‌شوند:</p>
              <ul>
                <li class="mt-3">
                  <a href="https://www.tensorflow.org/"><img width="180" src="{{asset('assets/images/icons/brands/tensorflow.png')}}" alt="tensorflow logo"></a>
                  <p class="mr-3">TensorFlow: <a href="https://www.tensorflow.org/">TensorFlow </a>یک کتابخانه متن باز برای یادگیری عمیق هوش مصنوعی است که توسط تیم مهندسی Google Brain توسعه یافته است. این ابزار قادر است با استفاده از شبکه های عصبی پیچیده، مدل های متنی را آموزش دهد و توسعه دهد. این مدل ها می توانند در تشخیص الگوهای مختلف متنی به کار برده شوند، از جمله دسته بندی متن، ترجمه، و پاسخگویی به سوالات.</p>
                </li>
                <li class="mt-3">
                  <a href="https://www.nltk.org/"><img width="180" src="{{asset('assets/images/icons/brands/nltk.png')}}" alt="nltk logo"></a>
                  <p>NLTK (Natural Language Toolkit): <a href="https://www.nltk.org/">NLTK</a> یک کتابخانه قدرتمند برای پردازش طبیعی زبان است که شامل توابع و روش‌های متنوعی برای پردازش و تحلیل متن، شاخص‌های استخراج اطلاعات، تشخیص قوانین گرامری و غیره است. </p>
                </li>
                <li class="mt-3">
                  <a href="https://spacy.io/"><img width="140" src="{{asset('assets/images/icons/brands/spacy.png')}}" alt="spacy logo"></a>
                  <p>SpaCy: <a href="https://spacy.io/">SpaCy</a> یک کتابخانه پردازش زبان طبیعی سریع و با قابلیت‌های قوی است. آن شامل ابزارهایی برای توکن‌بندی، تحلیل نحوی، تشخیص انجام وظیفه‌ها و استخراج اطلاعات است.</p>
                </li>
                <li class="mt-3">
                  <a href="https://github.com/RaRe-Technologies/gensim"><img width="180" src="{{asset('assets/images/icons/brands/gensim.png')}}" alt="gensim logo"></a>
                  <p>Gensim: <a href="https://github.com/RaRe-Technologies/gensim">Gensim</a> یک کتابخانه متن‌کاوی و مدل‌سازی موضوعی است. آن شامل ابزارها و الگوریتم‌هایی برای پیش‌پردازش متن، توصیف مدل‌های احتمالاتی برای بردارهای کلمه (Word Embedding) و تحلیل موضوعی است.</p>
                </li>
              </ul>
              <p>با استفاده از این کتابخانه‌ها، در شرکت آریاهامان مهرپارسه می‌توان برای پردازش داده‌های متنی از توابع و ویژگی‌های مربوطه استفاده کرده و بهبود عملکرد مدل Zal نسخه بتا در تحلیل داده‌ها و ارائه پاسخ به سوالات کاربران داشت.</p>
              <p>در نهایت ما توسط سرورهای پردازشی خودمان از طریق API با سرور اصلی جهت ارسال پاسخ استفاده می کنیم.</p>
              <p>تحقیقات و توسعه ما برای ایجاد یک موتور پردازشی تصویر با هوش مصنوعی به نام شهرزاد به نقطه رونمایی رسیده است و موتور پردازنده اصلی ما توسط stability.ai  و DALL·E 2 در حال آموزش دیدن است. </p>
              <p> امیدواریم این توضیحات برای شما مفید بوده باشد. در صورت داشتن سوالات بیشتر، در دسترس هستیم.</p>
            </div>
          </div>
        </div>
        {{-- <div class="col-md-4">
          <img src="{{asset('assets/images/main/about-us2.webp')}}" class="img-fluid rounded" alt="رخشای چیست؟">
        </div> --}}
      </div>
    </div>
  </div>
  <div class="container">
    <div class="row mt-5 d-flex justify-content-center">
      <div class="col-md-9 text-white pb-5">
        <div>
          <div class="mt-4 p-5 about-us-bottom text-white rounded">
            <p>ما یک تیم کوچک و شرکت فعال در بخش خصوصی  با سرمایه گذاری شخصی هستیم که بر طراحی، زیرساخت های انسانی و هوش مصنوعی متمرکز شده است.</p>
            <p>ما از لحاظ مالی به هیچ ارگان و نهادی وابسته نیستیم و تنها خود را ملزم به حفظ حریم شخصی کاربران خودمان می دانیم و بر ترویج و گسترش فرهنگ ملی و ایرانی تاکید داریم.</p>
          </div>
        </div>
      </div>
    </div>
  </div>
</div>
@include('layouts.footer')
<script src="{{asset('assets/js/bootstrap.min.js')}}"></script>
<script src="{{asset('assets/js/jquery.js')}}"></script>
<script src="{{asset('assets/js/script.js')}}"></script>
@endsection

